{ "summary" : "A dispatch-expression dispatches an invocation to a nearby function using multiple dispatch.", "ast" : "autumn.lang.compiler.ast.nodes.DispatchExpression", "syntax" : [[0, "<span class=\"keyword\">dispatch</span> <a href=\"ConstructPage.html?construct=Name\">name</a> ( <i><a href=\"TextPage.html?page=Expression\">argument</a><sub>1</sub></i> , ... , <i><a href=\"TextPage.html?page=Expression\">argument</a><sub>n</sub></i> )"]], "details" : [[0, "The potentially applicable function overloads will be selected statically."], [1, "The overloads will be sorted topologically from the most specific to the most generalized."], [1, "An overload is not applicable, if it takes a non reference-type parameter."], [1, "An overload is not applicable, if its return-type is not either a reference-type or the void-type."], [2, "If the return-type of an overload is the void-type, then the overload will appear to return null."], [1, "The enclosing function is not applicable for selection."], [2, "However, other overloads with the same name may be applicable."], [2, "This rule helps prevent accidental infinite recursion."], [0, "Boxing of the arguments will be performed, when necessary."], [0, "Unboxing of the arguments will not be performed."], [0, "Coercion of the arguments will not be performed."], [0, "At runtime, the overload to invoke is selected as follows:"], [1, "Let A<sub>1</sub> ... A<sub>n</sub> denote the arguments."], [1, "Select the first overload from the sorted list of overloads, where each argument matches the related parameter."], [2, "Let P<sub>1</sub> ... P<sub>n</sub> denote the types of an overload's parameters."], [3, "A<sub>i</sub> matches P<sub>i</sub>, iff:"], [3, "A<sub>i</sub> is null."], [3, "A<sub>i</sub> is an instance of P<sub>i</sub>."], [0, "Return Type: <a href='https://docs.oracle.com/javase/7/docs/api/java/lang/Object.html'>Object</a>"], [0, "Return the value returned by invoking the dynamically selected function overload.."], [0, "A <a href=\"http://mackenzie-high.github.io/autumn/javadoc/autumn/lang/exceptions/DispatchException.html\">DispatchException</a> will be thrown, if none of the selected overloads will accept the arguments at runtime."]], "static-checks" : [["NO_SUCH_METHOD", "No applicable method overloads exist.", "null"]] }